In [4]:
import os
# List the contents of the "A-1 Data" directory
a1_data_dir = os.path.join("F:\MS\GIKI\smester 1\DATA MINING\Assignment\Assignment\A-1 data")
a1_data_files = os.listdir(a1_data_dir)
a1_data_files

['Lahore', 'Peshawar']

In [5]:
#lahore folder path
lahore_folder_path = os.path.join(a1_data_dir, "Lahore")
lahore_files = os.listdir(lahore_folder_path)
lahore_files

['Lhr_Detail_100.txt',
 'Lhr_Detail_101.txt',
 'Lhr_Detail_102.txt',
 'Lhr_Detail_103.txt',
 'Lhr_Detail_104.txt',
 'Lhr_Detail_94.txt',
 'Lhr_Detail_95.txt',
 'Lhr_Detail_96.txt',
 'Lhr_Detail_97.txt',
 'Lhr_Detail_98.txt',
 'Lhr_Detail_99.txt',
 'Lhr_Detail_MS_101.txt',
 'Lhr_Detail_MS_102.txt',
 'Lhr_Detail_MS_103.txt',
 'Lhr_Detail_MS_104.txt',
 'Lhr_Student_100.txt',
 'Lhr_Student_101.txt',
 'Lhr_Student_102.txt',
 'Lhr_Student_103.txt',
 'Lhr_Student_104.txt',
 'Lhr_Student_94.txt',
 'Lhr_Student_95.txt',
 'Lhr_Student_96.txt',
 'Lhr_Student_97.txt',
 'Lhr_Student_98.txt',
 'Lhr_Student_99.txt',
 'Lhr_Student_MS_101.txt',
 'Lhr_Student_MS_102.txt',
 'Lhr_Student_MS_103.txt',
 'Lhr_Student_MS_104.txt',
 'Transfer.txt']

In [6]:
#peshawar folder path
peshawar_folder_path = os.path.join(a1_data_dir, "Peshawar")
peshawar_files = os.listdir(peshawar_folder_path)
peshawar_files

['BS_P_100_Reg.txt',
 'BS_P_100_Student.txt',
 'BS_P_101_Reg.txt',
 'BS_P_101_Student.txt',
 'BS_P_102_Reg.txt',
 'BS_P_102_Student.txt',
 'BS_P_103_Reg.txt',
 'BS_P_103_Student.txt',
 'BS_P_104_Reg.txt',
 'BS_P_104_Student.txt',
 'BS_P_94_Reg.txt',
 'BS_P_94_Student.txt',
 'BS_P_95_Reg.txt',
 'BS_P_95_Student.txt',
 'BS_P_96_Reg.txt',
 'BS_P_96_Student.txt',
 'BS_P_97_Reg.txt',
 'BS_P_97_Student.txt',
 'BS_P_98_Reg.txt',
 'BS_P_98_Student.txt',
 'BS_P_99_Reg.txt',
 'BS_P_99_Student.txt',
 'MS_P_101_Reg.txt',
 'MS_P_101_Student.txt',
 'MS_P_102_Reg.txt',
 'MS_P_102_Student.txt',
 'MS_P_103_Reg.txt',
 'MS_P_103_Student.txt',
 'MS_P_104_Reg.txt',
 'MS_P_104_Student.txt']

In [12]:
import pandas as pd
import os

# Adjust the loading function to match Peshawar's naming convention
def load_all_files(directory, campus):
    if campus == "Lahore":
        student_suffix = "Student"
        detail_suffix = "Detail"
    else:  # Peshawar
        student_suffix = "Student"
        detail_suffix = "Reg"
    
    student_files = [f for f in os.listdir(directory) if student_suffix in f]
    detail_files = [f for f in os.listdir(directory) if detail_suffix in f]
    
    student_data = pd.concat([pd.read_csv(os.path.join(directory, file), sep=",") for file in student_files])
    detail_data = pd.concat([pd.read_csv(os.path.join(directory, file), sep=",") for file in detail_files])
    
    return student_data, detail_data

# Define the path to the Peshawar directory
#peshawar_path = os.path.join("F:\MS\GIKI\smester 1\DATA MINING\Assignment\Assignment\A-1 data\Peshawar")


peshawar_students.head(), peshawar_details.head()
peshawar_students, peshawar_details = load_all_files(peshawar_path, "Peshawar")

# Display first few rows of each dataset for Peshawar
peshawar_students.head(), peshawar_details.head()

(   Reg#                                Name                       Father  \
 0  1800                        Emmad Farzan                Farzan Farooq
 1  1801                       Adila Shabeer               Shabeer Mujeeb
 2  1802                Bakht Junaid Ismaili            Mustansar Ismaili
 3  1803  Sana Ullah Viqar-ul-Islam Hussaini  AAmer Abdur Rahman Hussaini
 4  1804                          Nadia Haqq         Mouhammed Munir Haqq

                                       Address Date of Birth  lastDeg Reg Date  \
 0        House No. 401 s#  73 Kumria Mansehra      19-12-82    F.Sc.   1-8-00
 1     Ho. # 947 St. no.69  Illyas abad Gilgit       22-8-82      Fsc   4-8-00
 2  Ho. no.262 St. no.64  Air port coloney Psh       24-8-81  A level   8-8-00
 3            h no.576 S No.59  Biyaal Haripur       24-5-81     HSSC  11-8-00
 4    Ho. No.123 Street No.23  Bara market Psh       26-1-81  A level  14-8-00

   Reg Status Deg Status
 0          A          C
 1          A          C
 2          A          C
 3          A          C
 4          A          C  ,
    Reg# Courses  Score Program   Sem  Year
 0  1800  CS-101     73      CS  Fall  2000
 1  1800  CS-102     99      CS  Fall  2000
 2  1800  CS-103     70      CS  Fall  2000
 3  1800  CS-104     87      CS  Fall  2000
 4  1800  SS-201     56      CS  Fall  2000)

In [9]:
# Listing the contents of the "Lahore" directory to identify the student data files
lahore_files_list = os.listdir(lahore_folder_path)
lahore_files_list

['Lhr_Detail_100.txt',
 'Lhr_Detail_101.txt',
 'Lhr_Detail_102.txt',
 'Lhr_Detail_103.txt',
 'Lhr_Detail_104.txt',
 'Lhr_Detail_94.txt',
 'Lhr_Detail_95.txt',
 'Lhr_Detail_96.txt',
 'Lhr_Detail_97.txt',
 'Lhr_Detail_98.txt',
 'Lhr_Detail_99.txt',
 'Lhr_Detail_MS_101.txt',
 'Lhr_Detail_MS_102.txt',
 'Lhr_Detail_MS_103.txt',
 'Lhr_Detail_MS_104.txt',
 'Lhr_Student_100.txt',
 'Lhr_Student_101.txt',
 'Lhr_Student_102.txt',
 'Lhr_Student_103.txt',
 'Lhr_Student_104.txt',
 'Lhr_Student_94.txt',
 'Lhr_Student_95.txt',
 'Lhr_Student_96.txt',
 'Lhr_Student_97.txt',
 'Lhr_Student_98.txt',
 'Lhr_Student_99.txt',
 'Lhr_Student_MS_101.txt',
 'Lhr_Student_MS_102.txt',
 'Lhr_Student_MS_103.txt',
 'Lhr_Student_MS_104.txt',
 'Transfer.txt']

In [10]:
# Function to load all Lahore student and detail files
def load_lahore_files(directory):
    student_files = [f for f in os.listdir(directory) if "Lhr_Student" in f]
    detail_files = [f for f in os.listdir(directory) if "Lhr_Detail" in f]
    
    student_data = pd.concat([pd.read_csv(os.path.join(directory, file), sep=",") for file in student_files])
    detail_data = pd.concat([pd.read_csv(os.path.join(directory, file), sep=",") for file in detail_files])
    
    return student_data, detail_data

# Loading Lahore students and details data
lahore_students, lahore_details = load_lahore_files(lahore_folder_path)

# Checking the first few rows of the Lahore students dataset
lahore_students.head()

,SID,St_Name,Father_Name,Gender,Address,Date of Birth,Reg Date,Reg Status,Degree Status,Last Degree
0,2400,Gul Abdul Suleh Awan,Chodhary Mustafa Awan,0.0,H No.993 s no.74 kurang nala Multan,24-Nov-81,18-Aug-00,A,C,HSSC
1,2401,Fakhar Mujtaba,Mujtaba Qutab,0.0,Ho. no. 540 St. no. 69 Chan chirag LalaMusa,25-Aug-81,21-Aug-00,A,C,A level
2,2402,Zeenat Ayyaz,Ayyaz Abdul Suleh,1.0,h no. 855 St. no. 32 Kotlia Sialkot,27-Aug-81,24-Aug-00,A,C,HSSC
3,2403,Wajid Abdul Hameed Namani,Shaheen Namani,0.0,Ho. No. 169 S No. 28 Saidpur road Bhawalpur,27-May-81,27-Aug-00,A,C,A level
4,2404,Annan Kiyyani,Soneel Mehmood Kiyyani,0.0,H# 484 Street No. 23 Jaamia Masjid road Kharian,29-Jan-80,2-Aug-00,A,C,A-Level

In [17]:
# Loading the reference list of female names
female_names = set()
with open('F:\MS\GIKI\smester 1\DATA MINING\Assignment\Assignment\Female.txt', 'r') as file:
    for line in file:
        female_names.add(line.strip())

# Loading the reference list of cities
cities = set()
with open('F:/MS/GIKI/smester 1/DATA MINING/Assignment/Assignment/PakistanCitiesList.txt', 'r') as file:
    for line in file:
        cities.add(line.strip())

# Checking the first few names and cities
list(female_names)[:5], list(cities)[:5]

(['Mounazza', 'Nafia', 'Rida', 'Qurat-ul-Ain', 'Rabia'],
 ['Lalamusa', 'Multan', 'Faisalabad', 'D.I. Khan', 'Jacobabad'])

In [29]:
lst=open("F:/MS/GIKI/smester 1/DATA MINING/Assignment/Assignment/PakistanCitiesList.txt", 'r')
lst

In [35]:
# Loading the provided list of cities

with open("F:/MS/GIKI/smester 1/DATA MINING/Assignment/Assignment/PakistanCitiesList.txt", 'r') as file:
    cities_list = file.read().splitlines()
# with open("F:\MS\GIKI\smester 1\DATA MINING\Assignment\Assignment\PakistanCitiesList.txt", "r") as file:
#     cities_list = file.read().splitlines()

# Splitting the 'Name' column into 'First Name' and 'Last Name' for Peshawar students
peshawar_students['First Name'] = peshawar_students['Name'].str.split().str[0]
peshawar_students['Last Name'] = peshawar_students['Name'].str.split().str[-1]

# Splitting the 'Father' column into 'Father First Name' and 'Father Last Name' for Peshawar students
peshawar_students['Father First Name'] = peshawar_students['Father'].str.split().str[0]
peshawar_students['Father Last Name'] = peshawar_students['Father'].str.split().str[-1]

# Standardizing the city names in the Peshawar students' dataset using the provided cities list
peshawar_students['City Name'] = peshawar_students['Address'].str.split().str[-1]
peshawar_students['City Name'] = peshawar_students['City Name'].apply(lambda x: x if x in cities_list else None)

# Displaying the first few rows to check the changes for Peshawar students
peshawar_students[['Name', 'First Name', 'Last Name', 'Father', 'Father First Name', 'Father Last Name', 'Address', 'City Name']].head()

,Name,First Name,Last Name,Father,Father First Name,Father Last Name,Address,City Name
0,Emmad Farzan,Emmad,Farzan,Farzan Farooq,Farzan,Farooq,House No. 401 s# 73 Kumria Mansehra,Mansehra
1,Adila Shabeer,Adila,Shabeer,Shabeer Mujeeb,Shabeer,Mujeeb,Ho. # 947 St. no.69 Illyas abad Gilgit,Gilgit
2,Bakht Junaid Ismaili,Bakht,Ismaili,Mustansar Ismaili,Mustansar,Ismaili,Ho. no.262 St. no.64 Air port coloney Psh,None
3,Sana Ullah Viqar-ul-Islam Hussaini,Sana,Hussaini,AAmer Abdur Rahman Hussaini,AAmer,Hussaini,h no.576 S No.59 Biyaal Haripur,Haripur
4,Nadia Haqq,Nadia,Haqq,Mouhammed Munir Haqq,Mouhammed,Haqq,Ho. No.123 Street No.23 Bara market Psh,None

In [32]:
# Loading all student and details files for Lahore campus
lahore_students, lahore_details = load_all_files(lahore_folder_path, "Lahore")

# Displaying the first few rows of each dataset for Lahore
lahore_students_head, lahore_details_head = lahore_students.head(), lahore_details.head()
lahore_students_head, lahore_details_head

(    SID                    St_Name             Father_Name  Gender  \
 0  2400       Gul Abdul Suleh Awan   Chodhary Mustafa Awan     0.0
 1  2401             Fakhar Mujtaba           Mujtaba Qutab     0.0
 2  2402               Zeenat Ayyaz       Ayyaz Abdul Suleh     1.0
 3  2403  Wajid Abdul Hameed Namani          Shaheen Namani     0.0
 4  2404              Annan Kiyyani  Soneel Mehmood Kiyyani     0.0

                                             Address Date of Birth   Reg Date  \
 0              H No.993 s no.74  kurang nala Multan     24-Nov-81  18-Aug-00
 1       Ho. no. 540 St. no. 69 Chan chirag LalaMusa     25-Aug-81  21-Aug-00
 2               h no. 855 St. no. 32 Kotlia Sialkot     27-Aug-81  24-Aug-00
 3       Ho. No. 169 S No. 28 Saidpur road Bhawalpur     27-May-81  27-Aug-00
 4  H#  484 Street No. 23 Jaamia Masjid road Kharian     29-Jan-80   2-Aug-00

   Reg Status Degree Status Last Degree
 0          A             C        HSSC
 1          A             C     A level
 2          A             C        HSSC
 3          A             C     A level
 4          A             C     A-Level  ,
     SID Degree Semester  Course  Marks Discipline
 0  2400     BS   Fall00  CS-101     83         CS
 1  2400     BS   Fall00  CS-102     93         CS
 2  2400     BS   Fall00  CS-103     78         CS
 3  2400     BS   Fall00  CS-104     55         CS
 4  2400     BS   Fall00  SS-201     99         CS)

In [33]:
# Splitting the 'St_Name' column into 'First Name' and 'Last Name' for Lahore students
lahore_students['First Name'] = lahore_students['St_Name'].str.split().str[0]
lahore_students['Last Name'] = lahore_students['St_Name'].str.split().str[-1]

# Splitting the 'Father_Name' column into 'Father First Name' and 'Father Last Name' for Lahore students
lahore_students['Father First Name'] = lahore_students['Father_Name'].str.split().str[0]
lahore_students['Father Last Name'] = lahore_students['Father_Name'].str.split().str[-1]

# Extracting city names from 'Address' column for Lahore students
lahore_students['City Name'] = lahore_students['Address'].str.split().str[-1]

# Standardizing the city names in the Lahore students' dataset using the provided cities list
lahore_students['City Name'] = lahore_students['City Name'].apply(lambda x: x if x in cities_list else None)

# Standardizing the gender representation in the Lahore students' dataset
lahore_students['Gender'] = lahore_students['Gender'].apply(lambda x: 'F' if x == 1.0 else ('M' if x == 0.0 else None))

# Displaying the first few rows to check the changes
lahore_students[['St_Name', 'First Name', 'Last Name', 'Father_Name', 'Father First Name', 'Father Last Name', 'Address', 'City Name', 'Gender']].head()

,St_Name,First Name,Last Name,Father_Name,Father First Name,Father Last Name,Address,City Name,Gender
0,Gul Abdul Suleh Awan,Gul,Awan,Chodhary Mustafa Awan,Chodhary,Awan,H No.993 s no.74 kurang nala Multan,Multan,M
1,Fakhar Mujtaba,Fakhar,Mujtaba,Mujtaba Qutab,Mujtaba,Qutab,Ho. no. 540 St. no. 69 Chan chirag LalaMusa,None,M
2,Zeenat Ayyaz,Zeenat,Ayyaz,Ayyaz Abdul Suleh,Ayyaz,Suleh,h no. 855 St. no. 32 Kotlia Sialkot,Sialkot,F
3,Wajid Abdul Hameed Namani,Wajid,Namani,Shaheen Namani,Shaheen,Namani,Ho. No. 169 S No. 28 Saidpur road Bhawalpur,Bhawalpur,M
4,Annan Kiyyani,Annan,Kiyyani,Soneel Mehmood Kiyyani,Soneel,Kiyyani,H# 484 Street No. 23 Jaamia Masjid road Kharian,Kharian,M

In [52]:
peshawar_details.head()

    SID  Course  Marks Discipline Semester  Year
0  1800  CS-101     73         CS     Fall  2000
1  1800  CS-102     99         CS     Fall  2000
2  1800  CS-103     70         CS     Fall  2000
3  1800  CS-104     87         CS     Fall  2000
4  1800  SS-201     56         CS     Fall  2000

In [8]:
# Checking for missing values in Peshawar students' dataset
peshawar_students_missing = peshawar_students.isnull().sum()

# Checking for missing values in Peshawar courses' dataset
peshawar_details_missing = peshawar_details.isnull().sum()

peshawar_students_missing, peshawar_details_missing

(Reg#             0
 Name             0
 Father           0
 Address          0
 Date of Birth    0
 lastDeg          0
 Reg Date         0
 Reg Status       0
 Deg Status       0
 dtype: int64,
 Reg#       0
 Courses    0
 Score      0
 Program    0
 Sem        0
 Year       0
 dtype: int64)

In [36]:
# Harmonizing the column names
lahore_students.rename(columns={
    'St_Name': 'Name',
    'Father_Name': 'Father'
}, inplace=True)

# Concatenating the Lahore and Peshawar students' datasets
combined_students = pd.concat([lahore_students, peshawar_students], ignore_index=True)

# Verifying the integration by displaying the first few rows and the shape of the combined dataset
combined_students_head = combined_students.head()
combined_students_shape = combined_students.shape

combined_students_head, combined_students_shape

(      SID                       Name                  Father Gender  \
 0  2400.0       Gul Abdul Suleh Awan   Chodhary Mustafa Awan      M
 1  2401.0             Fakhar Mujtaba           Mujtaba Qutab      M
 2  2402.0               Zeenat Ayyaz       Ayyaz Abdul Suleh      F
 3  2403.0  Wajid Abdul Hameed Namani          Shaheen Namani      M
 4  2404.0              Annan Kiyyani  Soneel Mehmood Kiyyani      M

                                             Address Date of Birth   Reg Date  \
 0              H No.993 s no.74  kurang nala Multan     24-Nov-81  18-Aug-00
 1       Ho. no. 540 St. no. 69 Chan chirag LalaMusa     25-Aug-81  21-Aug-00
 2               h no. 855 St. no. 32 Kotlia Sialkot     27-Aug-81  24-Aug-00
 3       Ho. No. 169 S No. 28 Saidpur road Bhawalpur     27-May-81  27-Aug-00
 4  H#  484 Street No. 23 Jaamia Masjid road Kharian     29-Jan-80   2-Aug-00

   Reg Status Degree Status Last Degree First Name Last Name Father First Name  \
 0          A             C        HSSC        Gul      Awan          Chodhary
 1          A             C     A level     Fakhar   Mujtaba           Mujtaba
 2          A             C        HSSC     Zeenat     Ayyaz             Ayyaz
 3          A             C     A level      Wajid    Namani           Shaheen
 4          A             C     A-Level      Annan   Kiyyani            Soneel

   Father Last Name  City Name  Reg# lastDeg Deg Status
 0             Awan     Multan   NaN     NaN        NaN
 1            Qutab       None   NaN     NaN        NaN
 2            Suleh    Sialkot   NaN     NaN        NaN
 3           Namani  Bhawalpur   NaN     NaN        NaN
 4          Kiyyani    Kharian   NaN     NaN        NaN  ,
 (8900, 18))

In [37]:
# Computing the number of unique values and nulls for each column
unique_values = combined_students.nunique()
null_values = combined_students.isnull().sum()

# Checking for invalid gender values (other than 'M' and 'F')
invalid_gender_values = combined_students[~combined_students['Gender'].isin(['M', 'F'])]['Gender'].unique()

# Checking for invalid Reg Status values (other than 'A' and 'T')
invalid_reg_status_values = combined_students[~combined_students['Reg Status'].isin(['A', 'T'])]['Reg Status'].unique()

# Checking for invalid Degree Status values (other than 'C' and 'I')
invalid_degree_status_values = combined_students[~combined_students['Degree Status'].isin(['C', 'I'])]['Degree Status'].unique()

unique_values, null_values, invalid_gender_values, invalid_reg_status_values, invalid_degree_status_values

(SID                  4400
 Name                 8161
 Father               7664
 Gender                  2
 Address              7952
 Date of Birth        5495
 Reg Date              638
 Reg Status              1
 Degree Status           2
 Last Degree            12
 First Name            494
 Last Name             315
 Father First Name     293
 Father Last Name      315
 City Name              26
 Reg#                 3300
 lastDeg                12
 Deg Status              2
 dtype: int64,
 SID                  3700
 Name                    0
 Father                  0
 Gender               3703
 Address                 0
 Date of Birth           2
 Reg Date                0
 Reg Status              0
 Degree Status        3700
 Last Degree          3700
 First Name              0
 Last Name               0
 Father First Name       0
 Father Last Name        0
 City Name            2946
 Reg#                 5200
 lastDeg              5200
 Deg Status           5200
 dtype: int64,
 array([None, nan], dtype=object),
 array([], dtype=object),
 array([nan], dtype=object))

In [38]:
# Re-evaluating the number of unique SID values
unique_SID_values = combined_students['SID'].nunique()

# Differentiating the outputs with statements
output_statements = {
    "Unique SID Values": unique_SID_values,
    "Unique Values for Each Column": unique_values,
    "Number of Nulls for Each Column": null_values,
    "Invalid Gender Values": invalid_gender_values,
    "Invalid Reg Status Values": invalid_reg_status_values,
    "Invalid Degree Status Values": invalid_degree_status_values
}

output_statements

{'Unique SID Values': 4400,
 'Unique Values for Each Column': SID                  4400
 Name                 8161
 Father               7664
 Gender                  2
 Address              7952
 Date of Birth        5495
 Reg Date              638
 Reg Status              1
 Degree Status           2
 Last Degree            12
 First Name            494
 Last Name             315
 Father First Name     293
 Father Last Name      315
 City Name              26
 Reg#                 3300
 lastDeg                12
 Deg Status              2
 dtype: int64,
 'Number of Nulls for Each Column': SID                  3700
 Name                    0
 Father                  0
 Gender               3703
 Address                 0
 Date of Birth           2
 Reg Date                0
 Reg Status              0
 Degree Status        3700
 Last Degree          3700
 First Name              0
 Last Name               0
 Father First Name       0
 Father Last Name        0
 City Name            2946
 Reg#                 5200
 lastDeg              5200
 Deg Status           5200
 dtype: int64,
 'Invalid Gender Values': array([None, nan], dtype=object),
 'Invalid Reg Status Values': array([], dtype=object),
 'Invalid Degree Status Values': array([nan], dtype=object)}

# Total no. of courses

In [39]:
# Loading all course details for both Lahore and Peshawar campuses
lahore_courses = lahore_details
peshawar_courses = peshawar_details

# Harmonizing column names for Peshawar courses to match Lahore's
peshawar_courses.rename(columns={
    'Reg#': 'SID',
    'Courses': 'Course',
    'Score': 'Marks',
    'Program': 'Discipline',
    'Sem': 'Semester'
}, inplace=True)

# Since Lahore courses do not have the "Year" column, we'll add it based on the 'Semester' column
lahore_courses['Year'] = lahore_courses['Semester'].str[-2:].astype(int) + 2000

# Concatenating the Lahore and Peshawar courses
combined_courses = pd.concat([lahore_courses, peshawar_courses], ignore_index=True)

# Verifying the integration by displaying the first few rows and the shape of the combined courses dataset
combined_courses_head = combined_courses.head()
combined_courses_shape = combined_courses.shape

combined_courses_head, combined_courses_shape

(    SID Degree Semester  Course  Marks Discipline  Year
 0  2400     BS   Fall00  CS-101     83         CS  2000
 1  2400     BS   Fall00  CS-102     93         CS  2000
 2  2400     BS   Fall00  CS-103     78         CS  2000
 3  2400     BS   Fall00  CS-104     55         CS  2000
 4  2400     BS   Fall00  SS-201     99         CS  2000,
 (331800, 7))

In [40]:
# Computing the total number of unique courses
total_unique_courses = combined_courses['Course'].nunique()

# Computing the total number of female vs. male students
gender_distribution = combined_students['Gender'].value_counts()

total_unique_courses, gender_distribution

(120,
 M    3464
 F    1733
 Name: Gender, dtype: int64)

# Determining the number of people who've taken more than 5 courses in a semester

In [47]:
# 1. Relationship between total no. of unique student IDâ€™s and total no. of students for both campuses.

# For Lahore campus
unique_student_ids_lahore = lahore_students['SID'].nunique()
total_students_lahore = lahore_students.shape[0]

# For Peshawar campus
unique_student_ids_peshawar = peshawar_students['Reg#'].nunique()
total_students_peshawar = peshawar_students.shape[0]

unique_student_ids_lahore, total_students_lahore, unique_student_ids_peshawar, total_students_peshawar

(4400, 5200, 3300, 3700)

In [42]:
# Determining the number of people who've taken more than 5 courses in a semester
courses_per_student_per_semester = combined_courses.groupby(['SID', 'Semester']).size()
students_more_than_5_courses = courses_per_student_per_semester[courses_per_student_per_semester > 5].reset_index()['SID'].nunique()

# Analyzing the relationship between the total number of unique student IDs and the total number of students
total_unique_student_IDs = combined_students['SID'].nunique()
total_students = combined_students.shape[0]

# Printing the results
print(f"Total Number of Students Who've Taken More Than 5 Courses in a Semester: {students_more_than_5_courses}")
print(f"Total Unique Student IDs: {total_unique_student_IDs}")
print(f"Total Students: {total_students}")

Total Number of Students Who've Taken More Than 5 Courses in a Semester: 4400
Total Unique Student IDs: 4400
Total Students: 8900

In [ ]:


# Converting date columns to datetime format for validation
combined_students['Date of Birth'] = pd.to_datetime(combined_students['Date of Birth'], errors='coerce')
combined_students['Reg Date'] = pd.to_datetime(combined_students['Reg Date'], errors='coerce')

# Checking for records where DOB is not smaller than the Reg. Date
invalid_dob_regdate_records = combined_students[combined_students['Date of Birth'] >= combined_students['Reg Date']]

# Checking for invalid dates in the 'Date of Birth' and 'Reg Date' columns
invalid_dob_dates = combined_students['Date of Birth'].isnull().sum() - combined_students['Date of Birth'].isna().sum()
invalid_reg_dates = combined_students['Reg Date'].isnull().sum() - combined_students['Reg Date'].isna().sum()

invalid_dob_regdate_records_count = invalid_dob_regdate_records.shape[0]

# Printing the results
print(f"Invalid Date of Birth Entries: {invalid_dob_dates}")
print(f"Invalid Registration Date Entries: {invalid_reg_dates}")
print(f"Records Where Date of Birth is Not Smaller than the Registration Date: {invalid_dob_regdate_records_count}")

# Marks Validation Results:

In [43]:
# Validating the marks to ensure they are within the range 0 to 100
invalid_marks_records = combined_courses[(combined_courses['Marks'] < 0) | (combined_courses['Marks'] > 100)]

# Printing the results
invalid_marks_count = invalid_marks_records.shape[0]
print(f"Number of Records with Invalid Marks (outside 0-100 range): {invalid_marks_count}")

Number of Records with Invalid Marks (outside 0-100 range): 0

In [44]:
# Adding a 'Campus' column to both Lahore and Peshawar datasets
lahore_students['Campus'] = 'Lahore'
peshawar_students['Campus'] = 'Peshawar'

# Concatenating the datasets again with the 'Campus' column
combined_students_with_campus = pd.concat([lahore_students, peshawar_students], ignore_index=True)

# Verifying the integration by displaying the first few rows and the shape of the combined dataset with 'Campus' column
combined_students_with_campus_head = combined_students_with_campus.head()
combined_students_with_campus_shape = combined_students_with_campus.shape

combined_students_with_campus_head, combined_students_with_campus_shape

(      SID                       Name                  Father Gender  \
 0  2400.0       Gul Abdul Suleh Awan   Chodhary Mustafa Awan      M
 1  2401.0             Fakhar Mujtaba           Mujtaba Qutab      M
 2  2402.0               Zeenat Ayyaz       Ayyaz Abdul Suleh      F
 3  2403.0  Wajid Abdul Hameed Namani          Shaheen Namani      M
 4  2404.0              Annan Kiyyani  Soneel Mehmood Kiyyani      M

                                             Address Date of Birth   Reg Date  \
 0              H No.993 s no.74  kurang nala Multan     24-Nov-81  18-Aug-00
 1       Ho. no. 540 St. no. 69 Chan chirag LalaMusa     25-Aug-81  21-Aug-00
 2               h no. 855 St. no. 32 Kotlia Sialkot     27-Aug-81  24-Aug-00
 3       Ho. No. 169 S No. 28 Saidpur road Bhawalpur     27-May-81  27-Aug-00
 4  H#  484 Street No. 23 Jaamia Masjid road Kharian     29-Jan-80   2-Aug-00

   Reg Status Degree Status Last Degree First Name Last Name Father First Name  \
 0          A             C        HSSC        Gul      Awan          Chodhary
 1          A             C     A level     Fakhar   Mujtaba           Mujtaba
 2          A             C        HSSC     Zeenat     Ayyaz             Ayyaz
 3          A             C     A level      Wajid    Namani           Shaheen
 4          A             C     A-Level      Annan   Kiyyani            Soneel

   Father Last Name  City Name  Campus  Reg# lastDeg Deg Status
 0             Awan     Multan  Lahore   NaN     NaN        NaN
 1            Qutab       None  Lahore   NaN     NaN        NaN
 2            Suleh    Sialkot  Lahore   NaN     NaN        NaN
 3           Namani  Bhawalpur  Lahore   NaN     NaN        NaN
 4          Kiyyani    Kharian  Lahore   NaN     NaN        NaN  ,
 (8900, 19))

#  Average number of people per semester of each campus.

In [53]:

# For Lahore campus
avg_students_per_semester_lahore = lahore_details.groupby('Semester')['SID'].nunique().mean()

# For Peshawar campus
avg_students_per_semester_peshawar = peshawar_details.groupby('Semester')['SID'].nunique().mean()

avg_students_per_semester_lahore, avg_students_per_semester_peshawar

(1333.3333333333333, 3300.0)

#  Average number of students in every batch of each campus.

In [49]:


# Extracting the registration year for both campuses
lahore_students['Reg Year'] = pd.to_datetime(lahore_students['Reg Date']).dt.year
peshawar_students['Reg Year'] = pd.to_datetime(peshawar_students['Reg Date']).dt.year

# Calculating average students per batch (year) for both campuses
avg_students_per_batch_lahore = lahore_students.groupby('Reg Year')['SID'].nunique().mean()
avg_students_per_batch_peshawar = peshawar_students.groupby('Reg Year')['Reg#'].nunique().mean()

avg_students_per_batch_lahore, avg_students_per_batch_peshawar

(472.72727272727275, 336.3636363636364)